CSI API ETABS v1
cDStEN1993_1_1_2022.SetPreference Method
 Sets the value of a steel design preference item.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetPreference(
	int Item,
	double Value
)
Function SetPreference (
	Item As Integer,
	Value As Double
) As Integer
Dim instance As cDStEN1993_1_1_2022
Dim Item As Integer
Dim Value As Double
Dim returnValue As Integer
returnValue = instance.SetPreference(Item,
	Value)
int SetPreference(
	int Item,
	double Value
)
abstract SetPreference :
        Item : int *
        Value : float -> int
Parameters
Item
Type: System.Int32
 This is an integer between 1 and 24, inclusive, indicating the preference item considered.
Country
Combos equation
K factor method
Framing type
Partial safety factor, GammaM0
Partial safety factor, GammaM1
Partial safety factor, GammaM2
Consider deflection
DL deflection limit, L/Value
SDL + LL deflection limit, L/Value
LL deflection limit, L/Value
Total load deflection limit, L/Value
Total camber limit, L/Value
Pattern live load factor
Demand/capacity ratio limit
Multi-response case design
Reliability class
Behavior factor, q
System overstrength, Omega
Consider P-delta
Consider torsion
Ignore seismic code
Ignore special seismic load
Are Doubler plates plug-welded
Value
Type: System.Double
 The numeric value of the considered preference item.
 Country
1 = CEN Default
2 = United Kingdom
3 = Slovenia
4 = Bulgaria
5 = Norway
6 = Singapore
7 = Sweden
8 = Finland
9 = Denmark
10 = Portugal
11 = Germany
12 = Poland
13 = Ireland
 Combos equation
1 = Eq. 6.10
2 = Max of Eqs. 6.10a and 6.10b
 K factor method
1 = Method A
2 = Method B
3 = Both
 Framing type
1 = DCH-MRF (Ductility Class High - Moment Frame)
2 = DCM-MRF (Ductility Class Medium - Moment Frame)
3 = DCL-MRF (Ductility Class Low - Moment Frame)
4 = DCH-CBF (Ductility Class High - Concentrically Braced Frame)
5 = DCM-CBF (Ductility Class Medium - Concentrically Braced Frame)
6 = DCL-CBF (Ductility Class Low - Concentrically Braced Frame)
7 = DCH-EBF (Ductility Class High - Eccentrically Braced Frame)
8 = DCM-EBF (Ductility Class Medium - Eccentrically Braced Frame)
9 = DCL-EBF (Ductility Class Low - Eccentrically Braced Frame)
10 = Inverted Pendulum Structure
11 = Secondary
12 = Non Seismic
 Partial safety factor, GammaM0
Value > 0
 Partial safety factor, GammaM1
Value > 0
 Partial safety factor, GammaM2
Value > 0
 Consider deflection
0 = No
Any other value = Yes
 DL deflection limit, L/Value
Value > 0
 SDL + LL deflection limit, L/Value
Value > 0
 LL deflection limit, L/Value
Value > 0
 Total load deflection limit, L/Value
Value > 0
 Total camber limit limit, L/Value
Value > 0
 Pattern live load factor
Value > 0
 Demand/capacity ratio limit
Value > 0
 Multi-response case design
1 = Envelopes
2 = Step-by-Step
3 = Last Step
4 = Enveleopes -- All
5 = Step-by-Step -- All
 Reliability class
1 = Class 1
2 = Class 2
3 = Class 3
 Behavior factor, q
Value > 0
 System overstrength, Omega
Value > 0
 Consider P-delta
0 = No
Any other value = Yes
 Consider Torsion
0 = No
Any other value = Yes
 Ignore seismic code
0 = No
Any other value = Yes
 Ignore special seismic load
0 = No
Any other value = Yes
 Are Doubler plates plug-welded
0 = No
Any other value = Yes
Return Value
Type: Int32
 Returns zero if the item is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim Value As Double
   Dim ProgDet As Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
   ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'set steel design code
   ret = SapModel.DesignSteel.SetCode("EN 1993-1-1:2005")
'set overwrite item
   ret = SapModel.DesignSteel.EN1993_1_1_2005.SetPreference(2, 1)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cDStEN1993_1_1_2022 Interface
ETABSv1 Namespace